cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/services'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'ravenac95/sudolikeaboss'

brew 'ack'
brew 'autojump'
brew 'awk'
brew 'aws-iam-authenticator'
brew 'awscli'
brew 'bat'
brew 'brotli'
brew 'coreutils'
brew 'curl'
brew 'diff-so-fancy'
brew 'dnsmasq'
brew 'docker-compose'
brew 'docker-machine'
brew 'docker'
brew 'exa'
brew 'fasd'
brew 'fd'
brew 'findutils'
brew 'fzf'
brew 'git-delta'
brew 'git-extras'
brew 'git-quick-stats'
brew 'git'
brew 'gitin'
brew 'go'
brew 'gpg'
brew 'highlight'
brew 'htop-osx'
brew 'httpie'
brew 'jq'
brew 'keybase'
brew 'kube-prompt'
brew 'kube-ps1'
brew 'kubectl'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kubetail'
brew 'nginx'
brew 'openssl'
brew 'pyenv'
brew 'rust'
brew 'sudolikeaboss'
brew 'terminal-notifier'
brew 'terraform'
brew 'thefuck'
brew 'thefuck'
brew 'tree'
brew 'watch'
brew 'webp'
brew 'wget', args: ['enable-iri']
brew 'wrk'
brew 'yarn'
brew 'youtube-dl'
brew 'zplug'

cask 'alfred'
cask 'appcleaner'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'google-chrome-canary'
cask 'google-chrome'
cask 'graphql-playground'
cask 'iterm2'
cask 'miniconda'
cask 'safari-technology-preview'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'the-unarchiver'
cask 'timemachineeditor'
cask 'transmission'
cask 'veonim'
cask 'virtualbox'
cask 'vlc'
